In [1]:
import pandas as pd
import numpy as np

# Extracting data from database
import pymysql                 

# Establishing connection and authentication
from sqlalchemy import create_engine

from getpass import getpass

import seaborn as sns

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
# print(connection_string)
engine = create_engine(connection_string)

In [4]:
type(engine)

sqlalchemy.engine.base.Engine

# Create a query or queries to extract the information you think may be relevant for building the prediction model. It should include some film features and some rental features (X).

In [5]:
film_and_rental_query = '''
SELECT f.title, r.rental_date, f.rating, f.length, f.rental_duration, f.special_features, fc.category_id, c.name
FROM film f
LEFT JOIN inventory i
USING (film_id)
LEFT JOIN rental r
USING (inventory_id)
LEFT JOIN film_category fc
USING (film_id)
left join category c
using(category_id)
GROUP BY f.title
;

'''

In [6]:
# data = pd.read_sql_query(film_and_rental_query, engine)
# print(data.shape)
# data.head().T

# The above query works in SQL workbench but not in jupyter notebook. 
# Hence after the query I saved the results in .csv file and read it.

data = pd.read_csv("Results1.csv")
print(data.shape)
data.head()

(1000, 8)

,title,rental_date,rating,length,rental_duration,special_features,category_id,name
0,ACADEMY DINOSAUR,2005-07-08 19:03:15,PG,86,6,"Deleted Scenes,Behind the Scenes",6,Documentary
1,ACE GOLDFINGER,2005-08-01 04:24:47,G,48,3,"Trailers,Deleted Scenes",11,Horror
2,ADAPTATION HOLES,2005-07-27 01:21:19,NC-17,50,7,"Trailers,Deleted Scenes",6,Documentary
3,AFFAIR PREJUDICE,2005-07-12 02:40:41,G,117,5,"Commentaries,Behind the Scenes",11,Horror
4,AFRICAN EGG,2005-05-28 07:53:38,G,130,6,Deleted Scenes,8,Family

# Create a query to get the list of all unique film titles and a boolean indicating if it was rented (rental_date) in May 2005. (Create new column called - 'rented_in_may'). This will be our TARGET (y) variable.

In [7]:
data.isna().sum()

title                0
rental_date         42
rating               0
length               0
rental_duration      0
special_features     0
category_id          0
name                 0
dtype: int64

In [8]:
data.dtypes

title               object
rental_date         object
rating              object
length               int64
rental_duration      int64
special_features    object
category_id          int64
name                object
dtype: object

In [9]:
data["rental_date"] = pd.to_datetime(data["rental_date"])

In [10]:
data["rented_in_May"] = np.where((data["rental_date"].dt.month == 5), True, False)

In [11]:
data.head()

,title,rental_date,rating,length,rental_duration,special_features,category_id,name,rented_in_May
0,ACADEMY DINOSAUR,2005-07-08 19:03:15,PG,86,6,"Deleted Scenes,Behind the Scenes",6,Documentary,False
1,ACE GOLDFINGER,2005-08-01 04:24:47,G,48,3,"Trailers,Deleted Scenes",11,Horror,False
2,ADAPTATION HOLES,2005-07-27 01:21:19,NC-17,50,7,"Trailers,Deleted Scenes",6,Documentary,False
3,AFFAIR PREJUDICE,2005-07-12 02:40:41,G,117,5,"Commentaries,Behind the Scenes",11,Horror,False
4,AFRICAN EGG,2005-05-28 07:53:38,G,130,6,Deleted Scenes,8,Family,True

In [12]:
display(data.dtypes)
data.isna().sum()

title                       object
rental_date         datetime64[ns]
rating                      object
length                       int64
rental_duration              int64
special_features            object
category_id                  int64
name                        object
rented_in_May                 bool
dtype: object

title                0
rental_date         42
rating               0
length               0
rental_duration      0
special_features     0
category_id          0
name                 0
rented_in_May        0
dtype: int64

# Read the data into a Pandas dataframe. At this point you should have 1000 rows. Number of columns depends on the number of features you chose.

In [13]:
data.shape

(1000, 9)

# Analyze extracted features (X) and transform them. You may need to encode some categorical variables, or scale numerical variables.

In [14]:
# splited = pd.DataFrame(data['special_features'].values.tolist()).rename(columns={0:'special_features'})
# display(type(splited))
# splited = splited['special_features'].str.split(',', expand=True)
# splited

In [15]:
# splitted = data['special_features'].str.split(',', expand = True)
# splitted.count()
# sp_columns = ["SP_1", "SP_2", "SP_3", "SP_4"]
# splitted.columns = sp_columns
# splitted

In [16]:
sp_count = []
for index, row in data.iterrows():
    
    count = len(row["special_features"].split(","))
    sp_count.append(count)

    
data["special_feature_count"] = sp_count

In [17]:
data = data.drop(["special_features"], axis = 1)
# display(data["special_feature_count"].value_counts())
data.head()

,title,rental_date,rating,length,rental_duration,category_id,name,rented_in_May,special_feature_count
0,ACADEMY DINOSAUR,2005-07-08 19:03:15,PG,86,6,6,Documentary,False,2
1,ACE GOLDFINGER,2005-08-01 04:24:47,G,48,3,11,Horror,False,2
2,ADAPTATION HOLES,2005-07-27 01:21:19,NC-17,50,7,6,Documentary,False,2
3,AFFAIR PREJUDICE,2005-07-12 02:40:41,G,117,5,11,Horror,False,2
4,AFRICAN EGG,2005-05-28 07:53:38,G,130,6,8,Family,True,1

In [18]:
# Dropping the rented_date colummn as we don't need it now

data = data.drop(["rental_date", "category_id"], axis = 1)

# Creating features and target

In [19]:
# Target
y = data["rented_in_May"]

X = data.drop(["rented_in_May"], axis = 1)
X.columns

Index(['title', 'rating', 'length', 'rental_duration', 'name',
       'special_feature_count'],
      dtype='object')

In [2]:
# Separating X_num and X_cat.

X_num = data.select_dtypes(include = np.number)
X_cat = data.select_dtypes(include = object)

NameError: name 'data' is not defined

In [1]:


corr_matrix = X_num.corr()
sns.heatmap(corr_matrix, annot = True)

plt.show()

NameError: name 'X_num' is not defined

# Transforming numerical and categorical columns after train-test split

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1337)

In [22]:
from sklearn.preprocessing import MinMaxScaler

# Scaling the numerical columns

X_train_num = X_train.select_dtypes(include = np.number)

transformer = MinMaxScaler().fit(X_train_num)
X_train_normalized = transformer.transform(X_train_num)
X_train_norm = pd.DataFrame(X_train_normalized, columns=X_num.columns)
X_train_norm.head()

     length  rental_duration  special_feature_count
0  0.769784             0.50               0.000000
1  0.151079             0.75               0.000000
2  0.258993             0.00               0.333333
3  0.223022             0.50               0.000000
4  0.733813             0.25               0.333333

In [23]:
X_train.select_dtypes(include = object).head()

                 title rating         name
46           BABY HALL  NC-17      Foreign
789  SHOOTIST SUPERFLY  PG-13        Drama
722    REIGN GENTLEMEN  PG-13       Sci-Fi
283         ENEMY ODDS  NC-17        Music
39    ARMY FLINTSTONES      R  Documentary

In [24]:
from sklearn.preprocessing import OneHotEncoder

X_train_categorical = X_train.select_dtypes(include = object).drop("title" , axis = 1)

encoder = OneHotEncoder(drop='first').fit(X_train_categorical)

cols = encoder.get_feature_names_out(input_features=X_train_categorical.columns)
encoded = encoder.transform(X_train_categorical).toarray()
onehot_encoded = pd.DataFrame(encoded, columns = cols)
display(onehot_encoded.shape)
onehot_encoded.head()

(800, 19)

,rating_NC-17,rating_PG,rating_PG-13,rating_R,name_Animation,name_Children,name_Classics,name_Comedy,name_Documentary,name_Drama,name_Family,name_Foreign,name_Games,name_Horror,name_Music,name_New,name_Sci-Fi,name_Sports,name_Travel
0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [33]:
X_train_transformed = np.concatenate([X_train_norm, onehot_encoded], axis=1)

In [34]:
X_train_transformed

array([[0.76978417, 0.5       , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.15107914, 0.75      , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.25899281, 0.        , 0.33333333, ..., 1.        , 0.        ,
        0.        ],
       ...,
       [0.4676259 , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.90647482, 0.5       , 0.33333333, ..., 0.        , 0.        ,
        0.        ],
       [0.31654676, 0.5       , 0.66666667, ..., 0.        , 0.        ,
        0.        ]])

In [35]:
X_test_num = X_test.select_dtypes(include = np.number)

X_test_normalized = transformer.transform(X_test_num)
X_test_norm = pd.DataFrame(X_test_normalized)
X_test_norm.head()

          0     1         2
0  0.374101  0.00  0.333333
1  0.964029  0.75  0.333333
2  0.316547  0.25  0.000000
3  0.618705  1.00  0.666667
4  0.453237  0.25  1.000000

In [36]:
X_test_categorical = X_test.select_dtypes(include = object).drop("title" , axis = 1)

encoder1 = OneHotEncoder(drop='first').fit(X_test_categorical)

cols1 = encoder1.get_feature_names_out(input_features=X_test_categorical.columns)
encoded1 = encoder1.transform(X_test_categorical).toarray()
onehot_encoded1 = pd.DataFrame(encoded1, columns = cols1)
display(onehot_encoded1.shape)
onehot_encoded1.head()

(200, 19)

,rating_NC-17,rating_PG,rating_PG-13,rating_R,name_Animation,name_Children,name_Classics,name_Comedy,name_Documentary,name_Drama,name_Family,name_Foreign,name_Games,name_Horror,name_Music,name_New,name_Sci-Fi,name_Sports,name_Travel
0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
3,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [37]:
X_test_transformed = np.concatenate([X_test_norm, onehot_encoded1], axis=1)

In [38]:
X_test_transformed

array([[0.37410072, 0.        , 0.33333333, ..., 0.        , 0.        ,
        0.        ],
       [0.96402878, 0.75      , 0.33333333, ..., 0.        , 0.        ,
        0.        ],
       [0.31654676, 0.25      , 0.        , ..., 0.        , 0.        ,
        1.        ],
       ...,
       [0.27338129, 1.        , 0.33333333, ..., 0.        , 0.        ,
        0.        ],
       [0.29496403, 0.25      , 0.33333333, ..., 0.        , 0.        ,
        0.        ],
       [0.4028777 , 0.5       , 0.33333333, ..., 0.        , 0.        ,
        0.        ]])

# Training model and applying it

In [39]:
from sklearn.linear_model import LogisticRegression

classification = LogisticRegression(random_state=0, solver='saga',
                  multi_class='multinomial').fit(X_train_transformed, y_train)

In [40]:
predictions = classification.predict(X_test_transformed)
predictions
classification.score(X_test_transformed, y_test)

0.745

In [41]:
y_test.value_counts()

False    149
True      51
Name: rented_in_May, dtype: int64

In [42]:
pd.Series(predictions).value_counts()

False    200
dtype: int64